----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 1024, 14, 14]         787,456
          Identity-2         [-1, 14, 14, 1024]               0
        PatchEmbed-3         [-1, 14, 14, 1024]               0
           Dropout-4            [-1, 197, 1024]               0
          Identity-5            [-1, 197, 1024]               0
          Identity-6            [-1, 197, 1024]               0
         LayerNorm-7            [-1, 197, 1024]           2,048
            Linear-8            [-1, 197, 3072]       3,148,800
          Identity-9          [-1, 16, 197, 64]               0
         Identity-10          [-1, 16, 197, 64]               0
           Linear-11            [-1, 197, 1024]       1,049,600
          Dropout-12            [-1, 197, 1024]               0
           Linear-13            [-1, 197, 3072]       3,148,800
           Linear-14            [-1, 197, 3072]       3,148,800
        Attention-15            [-1, 197, 1024]               0
       LayerScale-16            [-1, 197, 1024]               0
         Identity-17            [-1, 197, 1024]               0
        LayerNorm-18            [-1, 197, 1024]           2,048
           Linear-19            [-1, 197, 4096]       4,198,400
             GELU-20            [-1, 197, 4096]               0
          Dropout-21            [-1, 197, 4096]               0
         Identity-22            [-1, 197, 4096]               0
           Linear-23            [-1, 197, 1024]       4,195,328
          Dropout-24            [-1, 197, 1024]               0
              Mlp-25            [-1, 197, 1024]               0
       LayerScale-26            [-1, 197, 1024]               0
         Identity-27            [-1, 197, 1024]               0
            Block-28            [-1, 197, 1024]               0
        LayerNorm-29            [-1, 197, 1024]           2,048
           Linear-30            [-1, 197, 3072]       3,148,800
         Identity-31          [-1, 16, 197, 64]               0
         Identity-32          [-1, 16, 197, 64]               0
           Linear-33            [-1, 197, 1024]       1,049,600
          Dropout-34            [-1, 197, 1024]               0
           Linear-35            [-1, 197, 3072]       3,148,800
           Linear-36            [-1, 197, 3072]       3,148,800
        Attention-37            [-1, 197, 1024]               0
       LayerScale-38            [-1, 197, 1024]               0
         Identity-39            [-1, 197, 1024]               0
        LayerNorm-40            [-1, 197, 1024]           2,048
           Linear-41            [-1, 197, 4096]       4,198,400
             GELU-42            [-1, 197, 4096]               0
          Dropout-43            [-1, 197, 4096]               0
         Identity-44            [-1, 197, 4096]               0
           Linear-45            [-1, 197, 1024]       4,195,328
          Dropout-46            [-1, 197, 1024]               0
              Mlp-47            [-1, 197, 1024]               0
       LayerScale-48            [-1, 197, 1024]               0
         Identity-49            [-1, 197, 1024]               0
            Block-50            [-1, 197, 1024]               0
        LayerNorm-51            [-1, 197, 1024]           2,048
           Linear-52            [-1, 197, 3072]       3,148,800
         Identity-53          [-1, 16, 197, 64]               0
         Identity-54          [-1, 16, 197, 64]               0
           Linear-55            [-1, 197, 1024]       1,049,600
          Dropout-56            [-1, 197, 1024]               0
           Linear-57            [-1, 197, 3072]       3,148,800
           Linear-58            [-1, 197, 3072]       3,148,800
        Attention-59            [-1, 197, 1024]               0
       LayerScale-60            [-1, 197, 1024]               0
         Identity-61            [-1, 197, 1024]               0
        LayerNorm-62            [-1, 197, 1024]           2,048
           Linear-63            [-1, 197, 4096]       4,198,400
             GELU-64            [-1, 197, 4096]               0
          Dropout-65            [-1, 197, 4096]               0
         Identity-66            [-1, 197, 4096]               0
           Linear-67            [-1, 197, 1024]       4,195,328
          Dropout-68            [-1, 197, 1024]               0
              Mlp-69            [-1, 197, 1024]               0
       LayerScale-70            [-1, 197, 1024]               0
         Identity-71            [-1, 197, 1024]               0
            Block-72            [-1, 197, 1024]               0
        LayerNorm-73            [-1, 197, 1024]           2,048
           Linear-74            [-1, 197, 3072]       3,148,800
         Identity-75          [-1, 16, 197, 64]               0
         Identity-76          [-1, 16, 197, 64]               0
           Linear-77            [-1, 197, 1024]       1,049,600
          Dropout-78            [-1, 197, 1024]               0
           Linear-79            [-1, 197, 3072]       3,148,800
           Linear-80            [-1, 197, 3072]       3,148,800
        Attention-81            [-1, 197, 1024]               0
       LayerScale-82            [-1, 197, 1024]               0
         Identity-83            [-1, 197, 1024]               0
        LayerNorm-84            [-1, 197, 1024]           2,048
           Linear-85            [-1, 197, 4096]       4,198,400
             GELU-86            [-1, 197, 4096]               0
          Dropout-87            [-1, 197, 4096]               0
         Identity-88            [-1, 197, 4096]               0
           Linear-89            [-1, 197, 1024]       4,195,328
          Dropout-90            [-1, 197, 1024]               0
              Mlp-91            [-1, 197, 1024]               0
       LayerScale-92            [-1, 197, 1024]               0
         Identity-93            [-1, 197, 1024]               0
            Block-94            [-1, 197, 1024]               0
        LayerNorm-95            [-1, 197, 1024]           2,048
           Linear-96            [-1, 197, 3072]       3,148,800
         Identity-97          [-1, 16, 197, 64]               0
         Identity-98          [-1, 16, 197, 64]               0
           Linear-99            [-1, 197, 1024]       1,049,600
         Dropout-100            [-1, 197, 1024]               0
          Linear-101            [-1, 197, 3072]       3,148,800
          Linear-102            [-1, 197, 3072]       3,148,800
       Attention-103            [-1, 197, 1024]               0
      LayerScale-104            [-1, 197, 1024]               0
        Identity-105            [-1, 197, 1024]               0
       LayerNorm-106            [-1, 197, 1024]           2,048
          Linear-107            [-1, 197, 4096]       4,198,400
            GELU-108            [-1, 197, 4096]               0
         Dropout-109            [-1, 197, 4096]               0
        Identity-110            [-1, 197, 4096]               0
          Linear-111            [-1, 197, 1024]       4,195,328
         Dropout-112            [-1, 197, 1024]               0
             Mlp-113            [-1, 197, 1024]               0
      LayerScale-114            [-1, 197, 1024]               0
        Identity-115            [-1, 197, 1024]               0
           Block-116            [-1, 197, 1024]               0
       LayerNorm-117            [-1, 197, 1024]           2,048
          Linear-118            [-1, 197, 3072]       3,148,800
        Identity-119          [-1, 16, 197, 64]               0
        Identity-120          [-1, 16, 197, 64]               0
          Linear-121            [-1, 197, 1024]       1,049,600
         Dropout-122            [-1, 197, 1024]               0
          Linear-123            [-1, 197, 3072]       3,148,800
          Linear-124            [-1, 197, 3072]       3,148,800
       Attention-125            [-1, 197, 1024]               0
      LayerScale-126            [-1, 197, 1024]               0
        Identity-127            [-1, 197, 1024]               0
       LayerNorm-128            [-1, 197, 1024]           2,048
          Linear-129            [-1, 197, 4096]       4,198,400
            GELU-130            [-1, 197, 4096]               0
         Dropout-131            [-1, 197, 4096]               0
        Identity-132            [-1, 197, 4096]               0
          Linear-133            [-1, 197, 1024]       4,195,328
         Dropout-134            [-1, 197, 1024]               0
             Mlp-135            [-1, 197, 1024]               0
      LayerScale-136            [-1, 197, 1024]               0
        Identity-137            [-1, 197, 1024]               0
           Block-138            [-1, 197, 1024]               0
       LayerNorm-139            [-1, 197, 1024]           2,048
          Linear-140            [-1, 197, 3072]       3,148,800
        Identity-141          [-1, 16, 197, 64]               0
        Identity-142          [-1, 16, 197, 64]               0
          Linear-143            [-1, 197, 1024]       1,049,600
         Dropout-144            [-1, 197, 1024]               0
          Linear-145            [-1, 197, 3072]       3,148,800
          Linear-146            [-1, 197, 3072]       3,148,800
       Attention-147            [-1, 197, 1024]               0
      LayerScale-148            [-1, 197, 1024]               0
        Identity-149            [-1, 197, 1024]               0
       LayerNorm-150            [-1, 197, 1024]           2,048
          Linear-151            [-1, 197, 4096]       4,198,400
            GELU-152            [-1, 197, 4096]               0
         Dropout-153            [-1, 197, 4096]               0
        Identity-154            [-1, 197, 4096]               0
          Linear-155            [-1, 197, 1024]       4,195,328
         Dropout-156            [-1, 197, 1024]               0
             Mlp-157            [-1, 197, 1024]               0
      LayerScale-158            [-1, 197, 1024]               0
        Identity-159            [-1, 197, 1024]               0
           Block-160            [-1, 197, 1024]               0
       LayerNorm-161            [-1, 197, 1024]           2,048
          Linear-162            [-1, 197, 3072]       3,148,800
        Identity-163          [-1, 16, 197, 64]               0
        Identity-164          [-1, 16, 197, 64]               0
          Linear-165            [-1, 197, 1024]       1,049,600
         Dropout-166            [-1, 197, 1024]               0
          Linear-167            [-1, 197, 3072]       3,148,800
          Linear-168            [-1, 197, 3072]       3,148,800
       Attention-169            [-1, 197, 1024]               0
      LayerScale-170            [-1, 197, 1024]               0
        Identity-171            [-1, 197, 1024]               0
       LayerNorm-172            [-1, 197, 1024]           2,048
          Linear-173            [-1, 197, 4096]       4,198,400
            GELU-174            [-1, 197, 4096]               0
         Dropout-175            [-1, 197, 4096]               0
        Identity-176            [-1, 197, 4096]               0
          Linear-177            [-1, 197, 1024]       4,195,328
         Dropout-178            [-1, 197, 1024]               0
             Mlp-179            [-1, 197, 1024]               0
      LayerScale-180            [-1, 197, 1024]               0
        Identity-181            [-1, 197, 1024]               0
           Block-182            [-1, 197, 1024]               0
       LayerNorm-183            [-1, 197, 1024]           2,048
          Linear-184            [-1, 197, 3072]       3,148,800
        Identity-185          [-1, 16, 197, 64]               0
        Identity-186          [-1, 16, 197, 64]               0
          Linear-187            [-1, 197, 1024]       1,049,600
         Dropout-188            [-1, 197, 1024]               0
          Linear-189            [-1, 197, 3072]       3,148,800
          Linear-190            [-1, 197, 3072]       3,148,800
       Attention-191            [-1, 197, 1024]               0
      LayerScale-192            [-1, 197, 1024]               0
        Identity-193            [-1, 197, 1024]               0
       LayerNorm-194            [-1, 197, 1024]           2,048
          Linear-195            [-1, 197, 4096]       4,198,400
            GELU-196            [-1, 197, 4096]               0
         Dropout-197            [-1, 197, 4096]               0
        Identity-198            [-1, 197, 4096]               0
          Linear-199            [-1, 197, 1024]       4,195,328
         Dropout-200            [-1, 197, 1024]               0
             Mlp-201            [-1, 197, 1024]               0
      LayerScale-202            [-1, 197, 1024]               0
        Identity-203            [-1, 197, 1024]               0
           Block-204            [-1, 197, 1024]               0
       LayerNorm-205            [-1, 197, 1024]           2,048
          Linear-206            [-1, 197, 3072]       3,148,800
        Identity-207          [-1, 16, 197, 64]               0
        Identity-208          [-1, 16, 197, 64]               0
          Linear-209            [-1, 197, 1024]       1,049,600
         Dropout-210            [-1, 197, 1024]               0
          Linear-211            [-1, 197, 3072]       3,148,800
          Linear-212            [-1, 197, 3072]       3,148,800
       Attention-213            [-1, 197, 1024]               0
      LayerScale-214            [-1, 197, 1024]               0
        Identity-215            [-1, 197, 1024]               0
       LayerNorm-216            [-1, 197, 1024]           2,048
          Linear-217            [-1, 197, 4096]       4,198,400
            GELU-218            [-1, 197, 4096]               0
         Dropout-219            [-1, 197, 4096]               0
        Identity-220            [-1, 197, 4096]               0
          Linear-221            [-1, 197, 1024]       4,195,328
         Dropout-222            [-1, 197, 1024]               0
             Mlp-223            [-1, 197, 1024]               0
      LayerScale-224            [-1, 197, 1024]               0
        Identity-225            [-1, 197, 1024]               0
           Block-226            [-1, 197, 1024]               0
       LayerNorm-227            [-1, 197, 1024]           2,048
          Linear-228            [-1, 197, 3072]       3,148,800
        Identity-229          [-1, 16, 197, 64]               0
        Identity-230          [-1, 16, 197, 64]               0
          Linear-231            [-1, 197, 1024]       1,049,600
         Dropout-232            [-1, 197, 1024]               0
          Linear-233            [-1, 197, 3072]       3,148,800
          Linear-234            [-1, 197, 3072]       3,148,800
       Attention-235            [-1, 197, 1024]               0
      LayerScale-236            [-1, 197, 1024]               0
        Identity-237            [-1, 197, 1024]               0
       LayerNorm-238            [-1, 197, 1024]           2,048
          Linear-239            [-1, 197, 4096]       4,198,400
            GELU-240            [-1, 197, 4096]               0
         Dropout-241            [-1, 197, 4096]               0
        Identity-242            [-1, 197, 4096]               0
          Linear-243            [-1, 197, 1024]       4,195,328
         Dropout-244            [-1, 197, 1024]               0
             Mlp-245            [-1, 197, 1024]               0
      LayerScale-246            [-1, 197, 1024]               0
        Identity-247            [-1, 197, 1024]               0
           Block-248            [-1, 197, 1024]               0
       LayerNorm-249            [-1, 197, 1024]           2,048
          Linear-250            [-1, 197, 3072]       3,148,800
        Identity-251          [-1, 16, 197, 64]               0
        Identity-252          [-1, 16, 197, 64]               0
          Linear-253            [-1, 197, 1024]       1,049,600
         Dropout-254            [-1, 197, 1024]               0
          Linear-255            [-1, 197, 3072]       3,148,800
          Linear-256            [-1, 197, 3072]       3,148,800
       Attention-257            [-1, 197, 1024]               0
      LayerScale-258            [-1, 197, 1024]               0
        Identity-259            [-1, 197, 1024]               0
       LayerNorm-260            [-1, 197, 1024]           2,048
          Linear-261            [-1, 197, 4096]       4,198,400
            GELU-262            [-1, 197, 4096]               0
         Dropout-263            [-1, 197, 4096]               0
        Identity-264            [-1, 197, 4096]               0
          Linear-265            [-1, 197, 1024]       4,195,328
         Dropout-266            [-1, 197, 1024]               0
             Mlp-267            [-1, 197, 1024]               0
      LayerScale-268            [-1, 197, 1024]               0
        Identity-269            [-1, 197, 1024]               0
           Block-270            [-1, 197, 1024]               0
       LayerNorm-271            [-1, 197, 1024]           2,048
          Linear-272            [-1, 197, 3072]       3,148,800
        Identity-273          [-1, 16, 197, 64]               0
        Identity-274          [-1, 16, 197, 64]               0
          Linear-275            [-1, 197, 1024]       1,049,600
         Dropout-276            [-1, 197, 1024]               0
          Linear-277            [-1, 197, 3072]       3,148,800
          Linear-278            [-1, 197, 3072]       3,148,800
       Attention-279            [-1, 197, 1024]               0
      LayerScale-280            [-1, 197, 1024]               0
        Identity-281            [-1, 197, 1024]               0
       LayerNorm-282            [-1, 197, 1024]           2,048
          Linear-283            [-1, 197, 4096]       4,198,400
            GELU-284            [-1, 197, 4096]               0
         Dropout-285            [-1, 197, 4096]               0
        Identity-286            [-1, 197, 4096]               0
          Linear-287            [-1, 197, 1024]       4,195,328
         Dropout-288            [-1, 197, 1024]               0
             Mlp-289            [-1, 197, 1024]               0
      LayerScale-290            [-1, 197, 1024]               0
        Identity-291            [-1, 197, 1024]               0
           Block-292            [-1, 197, 1024]               0
       LayerNorm-293            [-1, 197, 1024]           2,048
          Linear-294            [-1, 197, 3072]       3,148,800
        Identity-295          [-1, 16, 197, 64]               0
        Identity-296          [-1, 16, 197, 64]               0
          Linear-297            [-1, 197, 1024]       1,049,600
         Dropout-298            [-1, 197, 1024]               0
          Linear-299            [-1, 197, 3072]       3,148,800
          Linear-300            [-1, 197, 3072]       3,148,800
       Attention-301            [-1, 197, 1024]               0
      LayerScale-302            [-1, 197, 1024]               0
        Identity-303            [-1, 197, 1024]               0
       LayerNorm-304            [-1, 197, 1024]           2,048
          Linear-305            [-1, 197, 4096]       4,198,400
            GELU-306            [-1, 197, 4096]               0
         Dropout-307            [-1, 197, 4096]               0
        Identity-308            [-1, 197, 4096]               0
          Linear-309            [-1, 197, 1024]       4,195,328
         Dropout-310            [-1, 197, 1024]               0
             Mlp-311            [-1, 197, 1024]               0
      LayerScale-312            [-1, 197, 1024]               0
        Identity-313            [-1, 197, 1024]               0
           Block-314            [-1, 197, 1024]               0
       LayerNorm-315            [-1, 197, 1024]           2,048
          Linear-316            [-1, 197, 3072]       3,148,800
        Identity-317          [-1, 16, 197, 64]               0
        Identity-318          [-1, 16, 197, 64]               0
          Linear-319            [-1, 197, 1024]       1,049,600
         Dropout-320            [-1, 197, 1024]               0
          Linear-321            [-1, 197, 3072]       3,148,800
          Linear-322            [-1, 197, 3072]       3,148,800
       Attention-323            [-1, 197, 1024]               0
      LayerScale-324            [-1, 197, 1024]               0
        Identity-325            [-1, 197, 1024]               0
       LayerNorm-326            [-1, 197, 1024]           2,048
          Linear-327            [-1, 197, 4096]       4,198,400
            GELU-328            [-1, 197, 4096]               0
         Dropout-329            [-1, 197, 4096]               0
        Identity-330            [-1, 197, 4096]               0
          Linear-331            [-1, 197, 1024]       4,195,328
         Dropout-332            [-1, 197, 1024]               0
             Mlp-333            [-1, 197, 1024]               0
      LayerScale-334            [-1, 197, 1024]               0
        Identity-335            [-1, 197, 1024]               0
           Block-336            [-1, 197, 1024]               0
       LayerNorm-337            [-1, 197, 1024]           2,048
          Linear-338            [-1, 197, 3072]       3,148,800
        Identity-339          [-1, 16, 197, 64]               0
        Identity-340          [-1, 16, 197, 64]               0
          Linear-341            [-1, 197, 1024]       1,049,600
         Dropout-342            [-1, 197, 1024]               0
          Linear-343            [-1, 197, 3072]       3,148,800
          Linear-344            [-1, 197, 3072]       3,148,800
       Attention-345            [-1, 197, 1024]               0
      LayerScale-346            [-1, 197, 1024]               0
        Identity-347            [-1, 197, 1024]               0
       LayerNorm-348            [-1, 197, 1024]           2,048
          Linear-349            [-1, 197, 4096]       4,198,400
            GELU-350            [-1, 197, 4096]               0
         Dropout-351            [-1, 197, 4096]               0
        Identity-352            [-1, 197, 4096]               0
          Linear-353            [-1, 197, 1024]       4,195,328
         Dropout-354            [-1, 197, 1024]               0
             Mlp-355            [-1, 197, 1024]               0
      LayerScale-356            [-1, 197, 1024]               0
        Identity-357            [-1, 197, 1024]               0
           Block-358            [-1, 197, 1024]               0
       LayerNorm-359            [-1, 197, 1024]           2,048
          Linear-360            [-1, 197, 3072]       3,148,800
        Identity-361          [-1, 16, 197, 64]               0
        Identity-362          [-1, 16, 197, 64]               0
          Linear-363            [-1, 197, 1024]       1,049,600
         Dropout-364            [-1, 197, 1024]               0
          Linear-365            [-1, 197, 3072]       3,148,800
          Linear-366            [-1, 197, 3072]       3,148,800
       Attention-367            [-1, 197, 1024]               0
      LayerScale-368            [-1, 197, 1024]               0
        Identity-369            [-1, 197, 1024]               0
       LayerNorm-370            [-1, 197, 1024]           2,048
          Linear-371            [-1, 197, 4096]       4,198,400
            GELU-372            [-1, 197, 4096]               0
         Dropout-373            [-1, 197, 4096]               0
        Identity-374            [-1, 197, 4096]               0
          Linear-375            [-1, 197, 1024]       4,195,328
         Dropout-376            [-1, 197, 1024]               0
             Mlp-377            [-1, 197, 1024]               0
      LayerScale-378            [-1, 197, 1024]               0
        Identity-379            [-1, 197, 1024]               0
           Block-380            [-1, 197, 1024]               0
       LayerNorm-381            [-1, 197, 1024]           2,048
          Linear-382            [-1, 197, 3072]       3,148,800
        Identity-383          [-1, 16, 197, 64]               0
        Identity-384          [-1, 16, 197, 64]               0
          Linear-385            [-1, 197, 1024]       1,049,600
         Dropout-386            [-1, 197, 1024]               0
          Linear-387            [-1, 197, 3072]       3,148,800
          Linear-388            [-1, 197, 3072]       3,148,800
       Attention-389            [-1, 197, 1024]               0
      LayerScale-390            [-1, 197, 1024]               0
        Identity-391            [-1, 197, 1024]               0
       LayerNorm-392            [-1, 197, 1024]           2,048
          Linear-393            [-1, 197, 4096]       4,198,400
            GELU-394            [-1, 197, 4096]               0
         Dropout-395            [-1, 197, 4096]               0
        Identity-396            [-1, 197, 4096]               0
          Linear-397            [-1, 197, 1024]       4,195,328
         Dropout-398            [-1, 197, 1024]               0
             Mlp-399            [-1, 197, 1024]               0
      LayerScale-400            [-1, 197, 1024]               0
        Identity-401            [-1, 197, 1024]               0
           Block-402            [-1, 197, 1024]               0
       LayerNorm-403            [-1, 197, 1024]           2,048
          Linear-404            [-1, 197, 3072]       3,148,800
        Identity-405          [-1, 16, 197, 64]               0
        Identity-406          [-1, 16, 197, 64]               0
          Linear-407            [-1, 197, 1024]       1,049,600
         Dropout-408            [-1, 197, 1024]               0
          Linear-409            [-1, 197, 3072]       3,148,800
          Linear-410            [-1, 197, 3072]       3,148,800
       Attention-411            [-1, 197, 1024]               0
      LayerScale-412            [-1, 197, 1024]               0
        Identity-413            [-1, 197, 1024]               0
       LayerNorm-414            [-1, 197, 1024]           2,048
          Linear-415            [-1, 197, 4096]       4,198,400
            GELU-416            [-1, 197, 4096]               0
         Dropout-417            [-1, 197, 4096]               0
        Identity-418            [-1, 197, 4096]               0
          Linear-419            [-1, 197, 1024]       4,195,328
         Dropout-420            [-1, 197, 1024]               0
             Mlp-421            [-1, 197, 1024]               0
      LayerScale-422            [-1, 197, 1024]               0
        Identity-423            [-1, 197, 1024]               0
           Block-424            [-1, 197, 1024]               0
       LayerNorm-425            [-1, 197, 1024]           2,048
          Linear-426            [-1, 197, 3072]       3,148,800
        Identity-427          [-1, 16, 197, 64]               0
        Identity-428          [-1, 16, 197, 64]               0
          Linear-429            [-1, 197, 1024]       1,049,600
         Dropout-430            [-1, 197, 1024]               0
          Linear-431            [-1, 197, 3072]       3,148,800
          Linear-432            [-1, 197, 3072]       3,148,800
       Attention-433            [-1, 197, 1024]               0
      LayerScale-434            [-1, 197, 1024]               0
        Identity-435            [-1, 197, 1024]               0
       LayerNorm-436            [-1, 197, 1024]           2,048
          Linear-437            [-1, 197, 4096]       4,198,400
            GELU-438            [-1, 197, 4096]               0
         Dropout-439            [-1, 197, 4096]               0
        Identity-440            [-1, 197, 4096]               0
          Linear-441            [-1, 197, 1024]       4,195,328
         Dropout-442            [-1, 197, 1024]               0
             Mlp-443            [-1, 197, 1024]               0
      LayerScale-444            [-1, 197, 1024]               0
        Identity-445            [-1, 197, 1024]               0
           Block-446            [-1, 197, 1024]               0
       LayerNorm-447            [-1, 197, 1024]           2,048
          Linear-448            [-1, 197, 3072]       3,148,800
        Identity-449          [-1, 16, 197, 64]               0
        Identity-450          [-1, 16, 197, 64]               0
          Linear-451            [-1, 197, 1024]       1,049,600
         Dropout-452            [-1, 197, 1024]               0
          Linear-453            [-1, 197, 3072]       3,148,800
          Linear-454            [-1, 197, 3072]       3,148,800
       Attention-455            [-1, 197, 1024]               0
      LayerScale-456            [-1, 197, 1024]               0
        Identity-457            [-1, 197, 1024]               0
       LayerNorm-458            [-1, 197, 1024]           2,048
          Linear-459            [-1, 197, 4096]       4,198,400
            GELU-460            [-1, 197, 4096]               0
         Dropout-461            [-1, 197, 4096]               0
        Identity-462            [-1, 197, 4096]               0
          Linear-463            [-1, 197, 1024]       4,195,328
         Dropout-464            [-1, 197, 1024]               0
             Mlp-465            [-1, 197, 1024]               0
      LayerScale-466            [-1, 197, 1024]               0
        Identity-467            [-1, 197, 1024]               0
           Block-468            [-1, 197, 1024]               0
       LayerNorm-469            [-1, 197, 1024]           2,048
          Linear-470            [-1, 197, 3072]       3,148,800
        Identity-471          [-1, 16, 197, 64]               0
        Identity-472          [-1, 16, 197, 64]               0
          Linear-473            [-1, 197, 1024]       1,049,600
         Dropout-474            [-1, 197, 1024]               0
          Linear-475            [-1, 197, 3072]       3,148,800
          Linear-476            [-1, 197, 3072]       3,148,800
       Attention-477            [-1, 197, 1024]               0
      LayerScale-478            [-1, 197, 1024]               0
        Identity-479            [-1, 197, 1024]               0
       LayerNorm-480            [-1, 197, 1024]           2,048
          Linear-481            [-1, 197, 4096]       4,198,400
            GELU-482            [-1, 197, 4096]               0
         Dropout-483            [-1, 197, 4096]               0
        Identity-484            [-1, 197, 4096]               0
          Linear-485            [-1, 197, 1024]       4,195,328
         Dropout-486            [-1, 197, 1024]               0
             Mlp-487            [-1, 197, 1024]               0
      LayerScale-488            [-1, 197, 1024]               0
        Identity-489            [-1, 197, 1024]               0
           Block-490            [-1, 197, 1024]               0
       LayerNorm-491            [-1, 197, 1024]           2,048
          Linear-492            [-1, 197, 3072]       3,148,800
        Identity-493          [-1, 16, 197, 64]               0
        Identity-494          [-1, 16, 197, 64]               0
          Linear-495            [-1, 197, 1024]       1,049,600
         Dropout-496            [-1, 197, 1024]               0
          Linear-497            [-1, 197, 3072]       3,148,800
          Linear-498            [-1, 197, 3072]       3,148,800
       Attention-499            [-1, 197, 1024]               0
      LayerScale-500            [-1, 197, 1024]               0
        Identity-501            [-1, 197, 1024]               0
       LayerNorm-502            [-1, 197, 1024]           2,048
          Linear-503            [-1, 197, 4096]       4,198,400
            GELU-504            [-1, 197, 4096]               0
         Dropout-505            [-1, 197, 4096]               0
        Identity-506            [-1, 197, 4096]               0
          Linear-507            [-1, 197, 1024]       4,195,328
         Dropout-508            [-1, 197, 1024]               0
             Mlp-509            [-1, 197, 1024]               0
      LayerScale-510            [-1, 197, 1024]               0
        Identity-511            [-1, 197, 1024]               0
           Block-512            [-1, 197, 1024]               0
       LayerNorm-513            [-1, 197, 1024]           2,048
          Linear-514            [-1, 197, 3072]       3,148,800
        Identity-515          [-1, 16, 197, 64]               0
        Identity-516          [-1, 16, 197, 64]               0
          Linear-517            [-1, 197, 1024]       1,049,600
         Dropout-518            [-1, 197, 1024]               0
          Linear-519            [-1, 197, 3072]       3,148,800
          Linear-520            [-1, 197, 3072]       3,148,800
       Attention-521            [-1, 197, 1024]               0
      LayerScale-522            [-1, 197, 1024]               0
        Identity-523            [-1, 197, 1024]               0
       LayerNorm-524            [-1, 197, 1024]           2,048
          Linear-525            [-1, 197, 4096]       4,198,400
            GELU-526            [-1, 197, 4096]               0
         Dropout-527            [-1, 197, 4096]               0
        Identity-528            [-1, 197, 4096]               0
          Linear-529            [-1, 197, 1024]       4,195,328
         Dropout-530            [-1, 197, 1024]               0
             Mlp-531            [-1, 197, 1024]               0
      LayerScale-532            [-1, 197, 1024]               0
        Identity-533            [-1, 197, 1024]               0
           Block-534            [-1, 197, 1024]               0
       LayerNorm-535            [-1, 197, 1024]           2,048
        Identity-536                 [-1, 1024]               0
         Dropout-537                 [-1, 1024]               0
        Identity-538                 [-1, 1024]               0
================================================================
Total params: 454,241,280
Trainable params: 454,241,280
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 1488.27
Params size (MB): 1732.79
Estimated Total Size (MB): 3221.64
----------------------------------------------------------------